export const TASKS_BY_ENV = {
  "Непрерывная 2D": ["Тропы"],
  "Дискретная":     ["Патруль", "Посадка"],
  "Трёхмерная":     ["Патруль", "Тропы"],
}

export const WS_MAP = {
  "Непрерывная 2D/Тропы": "ws://127.0.0.1:8000/continuous/trail",
  "Дискретная/Патруль":   "ws://127.0.0.1:8000/discrete/patrol",
  "Дискретная/Посадка":   "ws://127.0.0.1:8000/discrete/reforestation",
  "Трёхмерная/Патруль":   "ws://127.0.0.1:8000/threed/patrol",
  "Трёхмерная/Тропы":     "ws://127.0.0.1:8000/threed/trail",
}

export const ALGOS_BY_ENV = {
  "Непрерывная 2D": ["PPO", "SAC", "TD3", "A2C"],
  "Дискретная":     ["PPO", "A2C"],
  "Трёхмерная":     ["PPO", "SAC", "TD3", "A2C"],
}